"""Definitions Category-Word pair for KBERI IAT experiments"""

# word_bundle = {
#     'main_category': {
#         '한국이름': [
#             '김민준', '선우진아', '한도윤', '정지호', '황보정희', '오서연', '민지우', '윤채원',
#         ],
#         '외국이름': [   # pair, peer, partner
#             '응우엔띠낌', '레꽁빈', '후인퀑탄', '팜탄빙', '산민나잉', '진꼬윈', '툰툰링', '원딴',
#         ],
#     },
#     'sub_category': {
#         '긍정': [
#             '매력적인', '멋진', '아름다운', '유쾌한', '미소짓는', '축하', '성공', '즐거움',
#         ],
#         '부정': [
#             '볼품없는', '역겨운', '불쾌한', '해로운', '실패', '고통', '혐오', '악취',
#         ],
#     }
# }

word_bundle = {
    'main_category': {
        '게임범주': [
            '플레이어', '프로게이머', '전자오락', '전략게임', '테트리스', '렙업', '아이템', 'e스포츠', 'RPG', '닌텐도', '플스', '최종보스',
        ],
        '': [   # pair, peer, partner
        ],
    },
    'sub_category': {
        '긍정': [
            '재미있는',
            '멋진',
            '아름다운',
            '똑똑한',
            '미소짓는',
            '유쾌한',
        ],
        '부정': [
            '찌푸리는',
            '초췌한',
            '볼품없는',
            '멍청한',
            '침울한',
            '불쾌한',
        ],
    }
}
